//#include<stdio.h>
//#include<iostream>
//using namespace std;
//
//int map[51][51];
//int cnt = 0;
//int N, M;
//
//// 0 : 북 
//// 1 : 동
//// 2 : 남
//// 3 : 서
//
//int dx[4] = { -1,0,1,0 };
//int dy[4] = { 0,1,0,-1 };
//
//int main() {
//
//	scanf("%d %d", &N, &M);
//
//	int r, c, d;
//	scanf("%d %d %d", &r, &c, &d);
//
//	for (int i = 1; i <= N; i++) {
//		for (int j = 1; j <= M; j++) {
//			scanf("%d", &map[i][j]);
//		}
//	}
//
//	while (1) {
//		if (map[r][c] == 0) {
//			map[r][c] = 1;
//			cnt++;
//		}
//		//북쪽인 경우
//		if (d == 0&&map[r][c-1]==0) {
//			printf("현재 북(%d)쪽이므로 서(%d)쪽으로 방향을 틀어줍니다. \n\n",0,3);
//			//서쪽으로 방향을 바꿔주고 
//			d = 3;
//			c = c - 1;
//			map[r][c] = 1;
//			cnt++;
//
//		}
//
//		//동쪽인 경우
//		if (d == 1&&map[r-1][c]==0) {
//			printf("현재 동(%d)쪽이므로 북(%d)쪽으로 방향을 틀어줍니다. \n\n",1,0);
//			d = 0;
//			r = r - 1;
//			map[r][c] = 1;
//			cnt++;
//		}
//
//		//남쪽인 경우
//		if (d == 2&&map[r][c+1]==0) {
//			printf("현재 남(%d)쪽이므로 동(%d)쪽으로 방향을 틀어줍니다. \n\n",2,1);
//			d = 1;
//			c = c + 1;
//			map[r][c] = 1;
//			cnt++;
//		}
//
//		//서쪽인 경우
//		if (d == 3&&map[r+1][c]==0) {
//			printf("현재 서(%d)쪽이므로 남(%d)쪽으로 방향을 틀어줍니다. \n\n",3,2);
//			d = 2;
//			r = r + 1;
//			map[r][c] = 1;
//			cnt++;
//		}
//
//		else {
//			break;
//		}
//
//	}
//
//
//}
//
